Revit 2027 API
PhaseArray.Append Method
Add the phase to the end of the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Append(
	Phase item
)
Public Overridable Sub Append (
	item As Phase
)
public:
virtual void Append(
	Phase^ item
)
abstract Append :
        item : Phase -> unit
override Append :
        item : Phase -> unit
Parameters
item Phase
The phase to be added.
See Also
Reference
PhaseArray Class
Autodesk.Revit.DB Namespace